## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:62" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:62" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:cf596ccd86254481f644c871c38a0c704fd5293118af6159b477faf61f7aca4b" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:7bbe9c8618fbec296412c662b76b9604adf0ba83821738171d0fcd191a966bfd"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 62 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-cpfValidation will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-cpfValidation" {
      ~ etag                   = "60913aeaecd4a28749c2e9bfea516d68-5" -> "7ddde8c911ed0fc306bcc30d962703f7"
        id                     = "cpfValidation.7ddde8c911ed0fc306bcc30d962703f7.zip"
        tags                   = {}
      ~ version_id             = "yevMQCyzlTIRcYZVM2_eTcKGQYlD_GWd" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-excelToJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-excelToJson" {
      ~ etag                   = "36f8a7805620df8f3916fa90462f893f-6" -> "041b89efc23b857c9dba4ed86ee811fb"
        id                     = "excelToJson.041b89efc23b857c9dba4ed86ee811fb.zip"
        tags                   = {}
      ~ version_id             = "qx7E1sxx.6SewkUJvMZ83X7BvJEglrzv" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-graphql must be replaced
+/- resource "aws_s3_object" "lambda_artifact-graphql" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "ed20e0ccfbabc341e78b7496c1b1021b-6" -> "bbbf8e23d76935cd16bcaced4d2d3d50"
      ~ id                     = "graphql.c63b76a94076aa0a0581ba1fa531d2d3.zip" -> (known after apply)
      ~ key                    = "graphql.c63b76a94076aa0a0581ba1fa531d2d3.zip" -> "graphql.bbbf8e23d76935cd16bcaced4d2d3d50.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "c63b76a94076aa0a0581ba1fa531d2d3" -> "bbbf8e23d76935cd16bcaced4d2d3d50"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "lXnhDbwuMMI4XiTIugqA2L3Op97_yiQz" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "d52b15f6f863408f80657e9dac1098a6" -> "733da1921fe51ab82103b18aff9038b0"
        id                     = "dist/200.html"
      ~ source_hash            = "d52b15f6f863408f80657e9dac1098a6" -> "733da1921fe51ab82103b18aff9038b0"
        tags                   = {}
      ~ version_id             = "GP7RsbL.r8GAxyBl02ZqfY5ppb3PVpS7" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "ff7744bde995d4bf40591b2b8ce14aa4" -> "cf4af724c8e15b2092ae30f2d7b6a00d"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "ff7744bde995d4bf40591b2b8ce14aa4" -> "cf4af724c8e15b2092ae30f2d7b6a00d"
        tags                   = {}
      ~ version_id             = "G8pv0zf4.DBHqOyJ_aEBfcfRtRhYtoB0" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "41ce1cfbcd9f12e4b088d7c475b886bf" -> "aa007009da9d5dbd8af13dc6280686da"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "41ce1cfbcd9f12e4b088d7c475b886bf" -> "aa007009da9d5dbd8af13dc6280686da"
        tags                   = {}
      ~ version_id             = "P2bSWrfO5vfp.zQvb0XMOEmGT5myLzhr" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "d52b15f6f863408f80657e9dac1098a6" -> "733da1921fe51ab82103b18aff9038b0"
        id                     = "dist/index.html"
      ~ source_hash            = "d52b15f6f863408f80657e9dac1098a6" -> "733da1921fe51ab82103b18aff9038b0"
        tags                   = {}
      ~ version_id             = "YrRnEBwC7PgZQtOmAMajCm.IemItjNLk" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.38202ff3.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "49b58ecfec104f953c242172d53293bf"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.38202ff3.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.38202ff3.js"
+       source_hash            = "49b58ecfec104f953c242172d53293bf"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.38202ff3.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "b703266ba347d460c07ac79899e011fa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.38202ff3.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.38202ff3.js.LICENSE.txt"
+       source_hash            = "b703266ba347d460c07ac79899e011fa"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.53365d17.js"] will be destroyed
  # (because key ["static/js/app.53365d17.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "cd46a4dabf17882e6e0fb7c2b3cf6b69" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.53365d17.js" -> null
-       key                    = "dist/static/js/app.53365d17.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.53365d17.js" -> null
-       source_hash            = "cd46a4dabf17882e6e0fb7c2b3cf6b69" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "ZxdHG9HJ1GhEbYX4w_.TVsV07rSTDOta" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.53365d17.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.53365d17.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b703266ba347d460c07ac79899e011fa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.53365d17.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.53365d17.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.53365d17.js.LICENSE.txt" -> null
-       source_hash            = "b703266ba347d460c07ac79899e011fa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "l33_f4OQFKiMNHhGD2eJeC_lzxJyhipa" -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:31" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:31/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "31" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "8592dc3319afe41676173af6cdf582f8ce3c3bae" -> "60bc6855cbe50245fe80bd8848cd7ad5129eafcc"
              ~ "DD_TAGS"                      = "git.commit.sha:8592dc3319afe41676173af6cdf582f8ce3c3bae,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:60bc6855cbe50245fe80bd8848cd7ad5129eafcc,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "8592dc3319afe41676173af6cdf582f8ce3c3bae" -> "60bc6855cbe50245fe80bd8848cd7ad5129eafcc"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "31" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-excelToJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:31" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:31/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "31" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "8592dc3319afe41676173af6cdf582f8ce3c3bae" -> "60bc6855cbe50245fe80bd8848cd7ad5129eafcc"
              ~ "DD_TAGS"                      = "git.commit.sha:8592dc3319afe41676173af6cdf582f8ce3c3bae,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:60bc6855cbe50245fe80bd8848cd7ad5129eafcc,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "8592dc3319afe41676173af6cdf582f8ce3c3bae" -> "60bc6855cbe50245fe80bd8848cd7ad5129eafcc"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "31" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ last_modified                  = "2024-03-28T18:36:56.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:78" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:78/invocations" -> (known after apply)
      ~ s3_key                         = "graphql.c63b76a94076aa0a0581ba1fa531d2d3.zip" -> "graphql.bbbf8e23d76935cd16bcaced4d2d3d50.zip"
        tags                           = {}
      ~ version                        = "78" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "8592dc3319afe41676173af6cdf582f8ce3c3bae" -> "60bc6855cbe50245fe80bd8848cd7ad5129eafcc"
              ~ "DD_TAGS"                            = "git.commit.sha:8592dc3319afe41676173af6cdf582f8ce3c3bae,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:60bc6855cbe50245fe80bd8848cd7ad5129eafcc,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "8592dc3319afe41676173af6cdf582f8ce3c3bae" -> "60bc6855cbe50245fe80bd8848cd7ad5129eafcc"
                # (17 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "78" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 7 to add, 10 to change, 7 to destroy.
```

</details>

*Pusher: @laurelkorwin, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8472196949)*